#include <stdio.h>

int main(void) {

    int a = 5;
    int *ptr = NULL; // Указатель на int
    ptr = &a; // &a -> взятие адреса переменной a. В переменную ptr кладем адрес переменной a.

    printf("ptr = %p\n", ptr); // Значение переменной ptr
    printf("*ptr = %d\n", *ptr); // Разыменовываем переменную ptr: прыгаем по адресу из ptr и вытаскиваем значение a
    printf("&ptr = %p\n", &ptr); // Адрес переменной ptr

    // Косвенно изменяем значение переменной a
    printf("a = %d\n", a);
    *ptr = 123;
    printf("a = %d\n", a);

    
    /*     ___________________________________________________
		   |	            							     |
		   |                                                 V
-----------|---------------|-------------------------------|---------------|--
  ..|  |   |ptr|   |   |   |   |   |   |   |   |   |   |   | a |   |   |   |..
-----------|---------------|-------------------------------|---------------|--
	     100 101 102 103 104							 112 113 114 115 116
			   
		int a = 5;
		int *ptr;   // sizeof(ptr) = sizeof(int *) = sizeof(ptr) = 4 or 8 byte (x86_32 or x86_64)
		ptr = &a;   // ptr = addr of a
		*ptr = 123; // dereference pointer ptr

	*/

    return 0;
}