#include <stdio.h>

int main(void) {

    int a = 5;
    int *ptr1 = NULL; // Указатель на int
    int **ptr2 = NULL; // Указатель на указатель на int

    ptr1 = &a; // в ptr1 кладем адрес переменной a
    ptr2 = &ptr1; // в ptr2 кладем адрес переменной ptr2

    printf("ptr = %p\n", ptr2); // Значение переменной ptr2
    printf("ptr = %p\n", *ptr2); // Значение переменной ptr1
    printf("ptr = %d\n", **ptr2); // Значение переменной a
    printf("ptr = %p\n", &ptr2); // адрес переменной ptr2

    // Косвенно изменяем значение переменной a
    printf("a = %d\n", a);
    **ptr2 = 123;
    printf("a = %d\n", a);


    /*
             __________________________________________________________________
	       __|_______________________________________________                  |
		   | |	            							     |                 |
		   | V                                               V                 |
	------|---------------|-------------------------------|---------------|--|---------------|--
	..|   | p |   |   |   |   |   |   |   |   |   |   |   | a |   |   |   |..| s |   |   |   |..
	------|---------------|-------------------------------|---------------|--|---------------|--
	     100 101 102 103 104							 112 113 114 115 116 128 129 130 131 132
	    
        int a = 5;
        int *p = &a;
        int **s = &p;
        **s = 2;

    */

    return 0;
}